~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 272, 272, 3)       0         
_________________________________________________________________
conv_1 (Conv2D)              (None, 272, 272, 16)      448       
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 136, 136, 16)      0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 136, 136, 32)      4640      
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 68, 68, 32)        0         
_________________________________________________________________
conv_3 (Conv2D)              (None, 68, 68, 64)        18496     
_________________________________________________________________
pool_3 (MaxPooling2D)        (None, 34, 34, 64)        0         
_________________________________________________________________
conv_4 (Conv2D)              (None, 34, 34, 128)       73856     
_________________________________________________________________
pool_4 (MaxPooling2D)        (None, 17, 17, 128)       0         
_________________________________________________________________
conv_7 (Conv2D)              (None, 17, 17, 1024)      1180672   
_________________________________________________________________
conv_8 (Conv2D)              (None, 17, 17, 1024)      9438208   
_________________________________________________________________
conv_9 (Conv2D)              (None, 17, 17, 6)         6150      
_________________________________________________________________
reshape_1 (Reshape)          (None, 17, 17, 6)         0         
=================================================================
Total params: 10,722,470
Trainable params: 10,722,470
Non-trainable params: 0
_________________________________________________________________
Test Metrics:
    Loss: 0.0021149300849966465
    Accuracy: 0.9956883980381873
    Precision: 0.0
    Recall: 0.0
    F1 Score: 0.0
_________________________________________________________________
Train Metrics:
    Loss: 0.0031132487830527232
    Accuracy: 0.994020386913119
    Precision: 0.0
    Recall: 0.0
    F1 Score: 0.0
_________________________________________________________________
Validation Metrics:
    Loss: 0.0019892666849397845
    Accuracy: 0.9959534829662692
    Precision: 0.0
    Recall: 0.0
    F1 Score: 0.0
_________________________________________________________________
Time:
    Train Time: 0:12:39.118925
    Full Time: 0:15:13.464383
_________________________________________________________________
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
